{"intro":[{"type":"text","value":"If you’re looking to knock back a pint in the UK, there’s a good chance you’ll wander into a watering hole named the Red Lion — the <a href=https://www.morningadvertiser.co.uk/Article/2019/05/22/What-are-the-most-popular-pub-names-in-the-UK>most popular pub name</a> in the country. And if you were looking to take in a pint at each Red Lion, well good luck, there are 352 and that’s one hell of a pub crawl."},{"type":"text","value":"But here at The Pudding, we’re up for the challenge. (Note: if you <i>really</i> want to test fate, try this <a href=http://www.math.uwaterloo.ca/tsp/pubs/index.html>crawl of every single pub</a> in the UK)."},{"type":"text","value":"We gathered pub names from <a href=https://www.pubsgalore.co.uk/>Pubs Galore</a>, the largest crowdsourced list of pubs in England, Scotland, Wales and Northern Ireland, and plotted the shortest route between pubs of the same name. That means 352 pints at Red Lions, or 258 pints at Royal Oaks, or 176 pints at Crown Inns — the three most common pub names. And, these names follow pretty familiar naming patterns: color+noun, royalty+noun, or noun+inn."},{"type":"text","value":"Of course some pubs stray from these patterns (we’re looking at you <a href=https://www.theguardian.com/uk-news/2019/jul/16/pub-longest-name-uk-reopens-next-pub-shortest-stalybridge-rifleman-q>The Old Thirteenth Cheshire Astley Volunteer Rifleman Corps Inn</a>), so let’s just limit ourselves to the common ones:"}],"combos":[{"id":"color-noun","first":"color","firstImg":"brush.jpg","firstAlt":"sketch of paintbrush","connector":"+","second":"noun","secondImg":"lion_alt.jpg","secondAlt":"sketch of lion","example":"Red Lion"},{"id":"royalty-noun","first":"royalty","firstImg":"royal.jpg","firstAlt":"sketch of coat of arms","connector":"+","second":"noun","secondImg":"tree.jpg","secondAlt":"sketch of tree","example":"Royal Oak"},{"id":"noun-inn","first":"noun","firstImg":"crown.jpg","firstAlt":"sketch of crown","connector":"+","second":"inn","secondImg":"inn_alt.jpg","secondAlt":"sketch of inn","example":"Crown Inn"},{"id":"noun-noun","first":"noun","firstImg":"fox.jpg","firstAlt":"sketch of fox","connector":"&","second":"noun","secondImg":"hound.jpg","secondAlt":"sketch of dog","example":"Fox & Hounds"}],"afterCombos":[{"type":"text","value":"<a href=https://www.thehistorypress.co.uk/articles/a-history-of-british-pub-names/>Pub name lore can be traced back</a> to the first century AD when the Roman Empire stretched to Great Britain. <a href=https://en.wikipedia.org/wiki/Taberna>Tabernae</a>, the precursors to taverns, would hang vine leaves outside inn’s where wine was sold. But during the Roman invasion, hard-to-find vine leaves were swapped for bushes, giving rise to names like The Bush Inn or The Bull & Bush."},{"type":"text","value":"This tradition of naming pubs after what hung above their doors continued into the Middle Ages where watering holes would display distinct objects like ploughs (The Plough Inn) or wheatsheafs (The Wheatsheaf) to attract patrons — many of whom were illiterate and needed the pictorial cues."},{"type":"text","value":"In 1393 <a href=http://mentalfloss.com/article/71131/why-do-british-pubs-have-illustrated-signs-outside> an act was passed</a> that required pubs and inns to have signs identifying themselves as official watering holes and many began to adopt names to honor the monarchy: The White Hart (<a href=https://en.wikipedia.org/wiki/White_Hart>the badge of King Richard II</a>), The Red Lion (King James I’s <a href=https://en.wikipedia.org/wiki/Royal_Arms_of_Scotland>red lion of Scotland</a>), and The Royal Oak (<a href=https://en.wikipedia.org/wiki/Royal_Oak>a symbol of then Prince Charles’ defiance</a> during the English Civil War)."},{"type":"text","value":"Now that you’ve got the backstory, let’s drink to that. Select a naming pattern below, then filter by name to generate a map and itinerary for your pub crawl."}],"methods":[{"type":"text","value":"Over 41,000 currently open pubs <a href=https://github.com/the-pudding/pubs-data>were collected</a> from <a href=https://www.pubsgalore.co.uk/>Pubs Galore</a>, where members maintain the largest list of pubs in the United Kingdom (England, Scotland, Wales and Northern Ireland). We focused on four common naming patterns and filtered the pubs into “color + noun”, “royalty + noun”, “noun + inn/hotel” and “noun & noun” groups. Then, we counted up pubs with the same name (i.e. there are 352 pubs named “Red Lion” and 258 pubs named “Royal Oak”), giving us over 200 unique names within our patterns. We removed names where there were fewer than 10 pubs, because you need at least 10 for a proper pub crawl."},{"type":"text","value":"To calculate the shortest pub crawl between pubs with the same name, we used <a href=https://docs.mapbox.com/api/navigation/#optimization>Mapbox’s Optimization API</a>, which returns a “duration-optimized route between the input coordinates.” The API works to solve the <a href=https://en.wikipedia.org/wiki/Travelling_salesman_problem>Traveling Salesperson Problem</a> (TSP), or the question: “Given a list of cities and the distances between each pair of cities, what is the shortest possible route that visits each city and returns to the origin city?” The Optimization API returned the pub stops coordinates in the order in which we needed to visit them for the shortest route. We then used <a href=https://docs.mapbox.com/help/glossary/directions-api/>Mapbox’s Direction API</a> to plot that route between pubs. Finally, we used <a href=https://docs.mapbox.com/mapbox-gl-js/api/>Mapbox GL JS</a> to display the routes on the above map. The <a href=https://blog.mapbox.com/designing-the-vintage-style-in-mapbox-studio-9da4aa2a627f>vintage style</a> was designed by Amy Lee Walton, a Principal Designer at Mapbox. Mapbox FTW!"},{"type":"text","value":"All the drawings used in this piece have been released into the public domain by the <a href=https://www.flickr.com/photos/britishlibrary/albums>British Library on flickr</a>."}]}